app/controllers/apartments_controller.rb

SELECT "apartments".* FROM "apartments"
---
  def index
    apartments = Apartment.all

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    apartment = Apartment.find(params[:id])

INSERT INTO "apartments" ("street_number", "city", "state", "zip", "country", "building_manager", "phone", "hours", "created_at", "updated_at", "user_id", "description", "image_url", "subject", "rent", "bedroom_count", "bathroom_count") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    apartment = current_user.apartments.create(apartment_params)

SELECT "apartments".* FROM "apartments" WHERE "apartments"."user_id" = $1 AND "apartments"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def edit
    apartment = current_user.apartments.find(params[:id])

SELECT "apartments".* FROM "apartments" WHERE "apartments"."user_id" = $1 AND "apartments"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "apartments" SET "description" = $1, "updated_at" = $2 WHERE "apartments"."id" = $3  [["description", "Live like a king! Parking for days. Pets allowed. Parties encouraged!"], ["updated_at", "2020-06-25 00:18:15.838291"], ["id", 12]]
---
  def update
    apartment = current_user.apartments.find(params[:id])
    apartment.update(apartment_params)

SELECT "apartments".* FROM "apartments" WHERE "apartments"."user_id" = $1 AND "apartments"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
DELETE FROM "apartments" WHERE "apartments"."id" = $1  [["id", 7]]
---
  def destroy
    apartment = current_user.apartments.find(params[:id])
    if apartment.destroy